brew "gh"
brew "fzf"
brew "mas"
brew "node@18"
brew "node@20"
brew "node"
brew "rust"
brew "bottom"
brew "cocoapods"
brew "graphviz"
brew "atuin"
brew "pnpm"
brew "bat"
brew "jsonpp"
brew "starship"
brew "eza"
brew "dust"
brew "delta"

cask "visual-studio-code"
cask "discord"
cask "1Password"
cask "1password-cli"
cask "orbstack"
cask "rectangle-pro"
cask "Firefox"
cask "Spotify"
cask "wezterm"
cask "lm-studio"
cask "parsec"
cask "arc"
cask "shortcat"
cask "chatgpt"
cask "zed"

vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "rust-lang.rust-analyzer"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "ambar.bundle-size"
vscode "yoavbls.pretty-ts-errors"
vscode "github.vscode-github-actions"
vscode "oven.bun-vscode"
vscode "redhat.java"
vscode "mathiasfrohlich.kotlin"
